{
	"intents": [
		{
			"tag": "Salam",
			"patterns": [
				"Halo",
				"Hai",
				"Selamat pagi",
				"Selamat siang",
				"Selamat sore",
				"Selamat malam",
				"Assalamu'alaikum",
				"Apa kabar?",
				"Halo, ada yang bisa dibantu?"
			],
			"responses": [
				"Halo! Selamat datang di website Universitas Mataram, ada yang bisa kami bantu?",
				"Hai, terima kasih sudah mengunjungi Universitas Mataram. Bagaimana kami bisa membantu Anda hari ini?",
				"Assalamu'alaikum! Selamat datang di Universitas Mataram, apa yang bisa kami bantu?",
				"Selamat datang di Universitas Mataram! Apakah ada informasi yang Anda butuhkan?",
				"Halo! Universitas Mataram siap membantu Anda. Silakan tanyakan apa pun yang ingin Anda ketahui.",
				"Hai! Apa kabar? Kami senang bisa membantu Anda di Universitas Mataram.",
				"Selamat datang di website resmi Universitas Mataram, kami siap membantu kebutuhan informasi Anda."
			]
		},
		{
			"tag": "Respon_Terima_Kasih",
			"patterns": [
				"Terima kasih",
				"Makasih",
				"Thanks",
				"Thank you",
				"Oke",
				"Okey",
				"Sip",
				"Mantap",
				"Baik"
			],
			"responses": [
				"Sama-sama! Senang bisa membantu Anda.",
				"Dengan senang hati! Jika ada pertanyaan lain, jangan ragu untuk bertanya.",
				"Terima kasih kembali! Semoga informasi ini bermanfaat.",
				"Oke, semoga membantu! Jangan sungkan jika butuh bantuan lagi.",
				"Senang bisa membantu, selamat melanjutkan aktivitas!",
				"Sama-sama! Jika ada yang perlu ditanyakan lagi, saya siap membantu.",
				"Baik! Jangan ragu untuk kembali jika ada yang ingin ditanyakan."
			]
		},
		{
			"tag": "Sikap",
			"patterns": [
				"Kepedulian Kemanusiaan dan Sosial",
				"Etika Akademik dan Profesi",
				"Kepatuhan terhadap Etika Profesional",
				"Kesadaran Sosial dan Kemanusiaan",
				"Menghormati Etika Akademik",
				"Tanggung Jawab Sosial",
				"Menjunjung Etika dalam Profesi",
				"Apa arti kepedulian terhadap kemanusiaan dan sosial?",
				"Mengapa etika akademik dan profesi itu penting?",
				"Bagaimana cara menunjukkan kepedulian terhadap kemanusiaan?",
				"Apa yang dimaksud dengan etika akademik?",
				"Kenapa kita harus peduli terhadap isu-isu sosial?",
				"Bagaimana cara menjaga etika dalam profesi?",
				"Apa yang dimaksud dengan tanggung jawab sosial?",
				"Mengapa penting untuk menjunjung etika dalam profesi?"
			],
			"responses": [
				"Memiliki kemampuan untuk memecahkan masalah kemanusiaan dan sosial, berpikiran terbuka, dan peduli terhadap etika akademik/profesi"
			]
		},
		{
			"tag": "Profesional_Tanggung Jawab_dan_Pembelajaran Berkelanjutan",
			"patterns": [
				"Sikap Profesional",
				"Tanggung Jawab?",
				"Pembelajaran Berkelanjutan?",
				"Bagaimana menunjukkan sikap profesional?",
				"Apa yang dimaksud dengan sikap profesional?",
				"Mengapa sikap profesional penting dalam pekerjaan?",
				"Apa arti dari tanggung jawab?",
				"Bagaimana cara menunjukkan tanggung jawab?",
				"Mengapa tanggung jawab itu penting?",
				"Apa itu pembelajaran berkelanjutan?",
				"Mengapa pembelajaran berkelanjutan penting?",
				"Bagaimana cara melakukan pembelajaran berkelanjutan?",
				"Apa manfaat dari pembelajaran berkelanjutan?",
				"Apa manfaat dari pembelajaran berkelanjutan?"
			],
			"responses": [
				"Menunjukkan sikap profesional dalam kondisi terbatas; memiliki kemampuan dan tanggung jawab untuk bekerja secara mandiri dan/atau dalam tim; dan siap untuk melakukan pembelajaran berkelanjutan"
			]
		},
		{
			"tag": "Keterampilan",
			"patterns": [
				"Kepemimpinan dan Komunikasi",
				"Pengalaman Kewirausahaan",
				"Bagaimana cara meningkatkan kepemimpinan dan komunikasi?",
				"Apa yang dimaksud dengan keterampilan kepemimpinan?",
				"Mengapa keterampilan komunikasi itu penting?",
				"Apa yang perlu diketahui tentang kepemimpinan dan komunikasi?",
				"Bagaimana mengembangkan pengalaman kewirausahaan?",
				"Apa manfaat dari pengalaman kewirausahaan?",
				"Mengapa pengalaman kewirausahaan penting dalam karier?",
				"Apa yang dimaksud dengan pengalaman kewirausahaan?",
				"Bagaimana cara memulai perjalanan kewirausahaan?",
				"Bagaimana keterampilan kepemimpinan mendukung kewirausahaan?"
			],
			"responses": [
				"Memiliki kemampuan manajerial dan komunikasi untuk membina bawahannya. Selain itu, kemampuan berkomunikasi (tertulis dan lisan) akan mendukung peran mereka untuk memulai dan memperluas jaringan kerja sama dengan mantan atasan, kolega, dan mitra potensial di dalam dan/atau di luar institusi/negara serta mengelola konflik yang mungkin terjadi",
				"Mampu merancang, memulai dan/atau mengimplementasikan bisnis, memelihara bisnis, mengembangkan bisnis, dan bahkan mendukungnya dengan teknologi informasi untuk mengevaluasi kemajuannya dengan mengelaborasi pengetahuan analisis data"
			]
		},
		{
			"tag": "Logika Ilmiah",
			"patterns": [
				"Pemikiran Kritis/Komputasional",
				"Penelitian Ilmu Pengetahuan dan Teknologi",
				"Menulis Karya Ilmiah",
				"Apa yang dimaksud dengan pemikiran kritis dan komputasional?",
				"Bagaimana cara mengembangkan pemikiran kritis?",
				"Mengapa pemikiran komputasional itu penting?",
				"Apa hubungan antara pemikiran kritis dan penelitian ilmiah?",
				"Bagaimana melakukan penelitian ilmu pengetahuan dan teknologi?",
				"Apa langkah-langkah dalam penelitian ilmiah?",
				"Mengapa penelitian dalam ilmu pengetahuan dan teknologi itu penting?",
				"Apa saja tantangan dalam menulis karya ilmiah?",
				"Bagaimana cara menulis karya ilmiah yang baik?",
				"Apa manfaat dari menulis karya ilmiah?"
			],
			"responses": [
				"Mampu menerapkan pemikiran kritis/komputasional secara logis, sistematis, dan inovatif; serta melakukan penelitian berdasarkan ilmu pengetahuan dan teknologi yang diperolehnya. Selain itu, para lulusan juga didorong untuk menulis karya ilmiah"
			]
		},
		{
			"tag": "Ilmu Pengetahuan",
			"patterns": [
				"Pengetahuan Fundamental dan Teknik",
				"Solusi Rekayasa Data",
				"Isu-isu Kontemporer dan Kearifan Lokal",
				"Apa yang dimaksud dengan pengetahuan fundamental dan teknik?",
				"Bagaimana cara memahami pengetahuan fundamental dalam ilmu pengetahuan?",
				"Mengapa teknik dasar penting dalam ilmu pengetahuan?",
				"Apa itu solusi rekayasa data?",
				"Bagaimana solusi rekayasa data dapat diterapkan?",
				"Mengapa penting untuk menggunakan solusi rekayasa data?",
				"Apa saja isu-isu kontemporer yang relevan saat ini?",
				"Bagaimana kearifan lokal mempengaruhi isu-isu kontemporer?",
				"Apa hubungan antara isu-isu kontemporer dan kearifan lokal?",
				"Mengapa kearifan lokal penting dalam konteks ilmu pengetahuan?"
			],
			"responses": [
				"Memiliki pengetahuan dasar yang kuat (matematika, komputasi, statistik, sistem komputer, dan jaringan) dan memecahkan masalah yang kompleks.",
				"Memiliki pengetahuan dan keahlian sebagai analis data dan/atau insinyur data; pengembang sistem AI; pengembang IoT; pengembang sistem informasi; administrator sistem; dan administrator basis data.",
				"Berpengalaman dalam mengatasi masalah-masalah lokal seperti sumber daya fisik dan sumber daya manusia; serta mampu memecahkan dan mengevaluasi masalah-masalah lokal dengan menggunakan teknologi canggih."
			]
		},
		{
			"tag": "cumlaude",
			"patterns": [
				"Berapa IPK yang harus dicapai untuk mendapat predikat cum laude?",
				"Apa syarat IPK untuk predikat cum laude?",
				"Bagaimana cara mencapai predikat cum laude?",
				"Apa yang diperlukan untuk mendapatkan gelar cum laude?",
				"Berapa nilai IPK yang harus diperoleh untuk cum laude?",
				"Apakah ada standar khusus untuk predikat cum laude di universitas?",
				"Apa saja kriteria untuk mendapatkan cum laude?",
				"Berapa IPK yang diperlukan agar bisa disebut cum laude?",
				"Apa pengaruh IPK terhadap predikat cum laude?"
			],
			"responses": [
				"IPK yang harus dicapai untuk mendapatkan predikat cumlaude mencapai IPK 3,51 (tiga koma lima satu) sampai dengan 4,00 (empat koma nol nol) dengan ketentuan, mata kuliah yang diulang paling banyak 3 (tiga) mata kuliah, tiap mata kuliah yang diulang maksimal 1 (satu) kali, nilai terendah dari seluruh mata pelajaran adalah B dan masa studi yang ditempuh n tahun ditambah 1 (satu) semester"
			]
		},
		{
			"tag": "Pendidikan_Definition",
			"patterns": [
				"Apa itu pendidikan?",
				"Definisi pendidikan?",
				"Pendidikan itu apa?",
				"Bagaimana mendefinisikan pendidikan?",
				"Apa pengertian dari pendidikan?",
				"Apa maksud dari istilah pendidikan?",
				"Apa yang dimaksud dengan pendidikan dalam konteks umum?",
				"Dapatkah Anda menjelaskan konsep pendidikan?",
				"Apa arti dari pendidikan menurut para ahli?",
				"Apa definisi pendidikan secara singkat?",
				"Apa aspek-aspek penting dari pendidikan?",
				"Bagaimana pendidikan didefinisikan dalam teori pendidikan?"
			],
			"responses": "Pendidikan adalah usaha sadar dan terencana untuk mewujudkan suasana belajar dan proses pembelajaran agar peserta didik secara aktif mengembangkan potensi dirinya untuk memiliki kekuatan spiritual keagamaan, pengendalian diri, kepribadian, kecerdasan, akhlak mulia, serta keterampilan yang diperlukan oleh dirinya, masyarakat, bangsa, dan negara."
		},
		{
			"tag": "Mahasiswa_Definition",
			"patterns": [
				"Apa yang dimaksud dengan mahasiswa?",
				"Definisi mahasiswa?",
				"Siapa yang disebut mahasiswa?",
				"Bagaimana mendefinisikan mahasiswa?",
				"Apa pengertian dari mahasiswa?",
				"Apa yang dimaksud dengan istilah mahasiswa?",
				"Siapa yang termasuk dalam kategori mahasiswa?",
				"Apa kriteria untuk disebut sebagai mahasiswa?",
				"Dapatkah Anda menjelaskan apa itu mahasiswa?",
				"Apa arti dari mahasiswa dalam konteks akademik?",
				"Apa yang membuat seseorang disebut mahasiswa?",
				"Apa perbedaan antara mahasiswa dan pelajar?"
			],
			"responses": [
				"Mahasiswa adalah peserta didik yang terdaftar dan belajar di Universitas Mataram."
			]
		},
		{
			"tag": "Mahasiswa_Baru_Definition",
			"patterns": [
				"Apa yang dimaksud dengan mahasiswa baru?",
				"Definisi mahasiswa baru?",
				"Apa pengertian dari mahasiswa baru?",
				"Bagaimana mendefinisikan mahasiswa baru?",
				"Siapa yang termasuk dalam kategori mahasiswa baru?",
				"Apa yang dimaksud dengan istilah mahasiswa baru?",
				"Apa ciri-ciri mahasiswa baru?",
				"Apa yang membedakan mahasiswa baru dari mahasiswa lama?",
				"Dapatkah Anda menjelaskan konsep mahasiswa baru?",
				"Apa yang perlu diketahui tentang mahasiswa baru?",
				"Apa arti dari mahasiswa baru dalam konteks pendidikan?"
			],
			"responses": "Mahasiswa baru adalah mahasiswa yang baru pertama kali terdaftar sebagai mahasiswa pada Universitas Mataram melalui seleksi masuk perguruan tinggi negeri sesuai dengan ketentuan yang berlaku."
		},
		{
			"tag": "Mahasiswa_Lama_Definition",
			"patterns": [
				"Apa yang dimaksud dengan mahasiswa lama?",
				"Definisi mahasiswa lama?",
				"Apa pengertian dari mahasiswa lama?",
				"Bagaimana mendefinisikan mahasiswa lama?",
				"Siapa yang termasuk dalam kategori mahasiswa lama?",
				"Apa yang dimaksud dengan istilah mahasiswa lama?",
				"Apa ciri-ciri mahasiswa lama?",
				"Apa yang membedakan mahasiswa lama dari mahasiswa baru?",
				"Dapatkah Anda menjelaskan konsep mahasiswa lama?",
				"Apa yang perlu diketahui tentang mahasiswa lama?",
				"Apa arti dari mahasiswa lama dalam konteks akademik?"
			],
			"responses": "Mahasiswa lama adalah mahasiswa yang masih mempunyai hak sebagai mahasiswa Universitas Mataram dan mahasiswa pindahan sesuai dengan tahun angkatannya di perguruan tinggi asal"
		},
		{
			"tag": "MMahasiswa_Asing_Definition",
			"patterns": [
				"Apa yang dimaksud dengan mahasiswa asing??",
				"Definisi mahasiswa asing?",
				"Apa pengertian dari mahasiswa asing?",
				"Bagaimana mendefinisikan mahasiswa asing?",
				"Siapa yang termasuk dalam kategori mahasiswa asing?",
				"Apa yang dimaksud dengan istilah mahasiswa asing?",
				"Apa ciri-ciri mahasiswa asing?",
				"Apa yang membedakan mahasiswa asing dari mahasiswa lokal?",
				"Dapatkah Anda menjelaskan konsep mahasiswa asing?",
				"Apa yang perlu diketahui tentang mahasiswa asing?",
				"Apa arti dari mahasiswa asing dalam konteks pendidikan internasional?"
			],
			"responses": "Mahasiswa asing adalah WNA yang mendaftar sebagai mahasiswa Universitas Mataram, yang telah memenuhi berbagai persyaratan yang ditentukan baik oleh Pemerintah Republik Indonesia maupun Universitas Mataram."
		},
		{
			"tag": "Mahasiswa_Pindahan_Definition",
			"patterns": [
				"Apa yang dimaksud dengan mahasiswa pindahan??",
				"Definisi mahasiswa pindahan?",
				"Apa pengertian dari mahasiswa pindahan?",
				"Bagaimana mendefinisikan mahasiswa pindahan?",
				"Siapa yang termasuk dalam kategori mahasiswa pindahan?",
				"Apa yang dimaksud dengan istilah mahasiswa pindahan?",
				"Apa ciri-ciri mahasiswa pindahan?",
				"Apa yang membedakan mahasiswa pindahan dari mahasiswa baru?",
				"Dapatkah Anda menjelaskan konsep mahasiswa pindahan?",
				"Apa yang perlu diketahui tentang mahasiswa pindahan?",
				"Apa arti dari mahasiswa pindahan dalam konteks perguruan tinggi?"
			],
			"responses": "Mahasiswa pindahan adalah mereka yang pindah dari program studi dalam satu fakultas, dan antar fakultas di lingkungan Universitas Mataram, serta dari dan ke perguruan tinggi negeri lain."
		},
		{
			"tag": "Unram_Definition",
			"patterns": [
				"Apa itu Universitas Mataram?",
				"Definisi Unram?",
				"Apa yang dimaksud dengan Universitas Mataram?",
				"Bagaimana mendefinisikan Universitas Mataram?",
				"Apa pengertian dari Unram?",
				"Apa itu Unram dalam konteks perguruan tinggi?",
				"Apa saja yang perlu diketahui tentang Universitas Mataram?",
				"Apa profil Universitas Mataram?",
				"Dapatkah Anda menjelaskan tentang Unram?",
				"Apa yang membedakan Universitas Mataram dari universitas lain?",
				"Apa tujuan dan visi dari Universitas Mataram?"
			],
			"responses": "Universitas Mataram adalah perguruan tinggi negeri yang menyelenggarakan pendidikan akademik dan dapat menyelenggarakan pendidikan vokasi dalam berbagai rumpun ilmu pengetahuan dan/atau teknologi serta jika memenuhi syarat dapat menyelenggarakan pendidikan profesi."
		},
		{
			"tag": "Fakultas_Definition",
			"patterns": [
				"Apa yang dimaksud dengan fakultas?",
				"Definisi fakultas?",
				"Apa pengertian dari fakultas?",
				"Bagaimana mendefinisikan fakultas dalam konteks pendidikan?",
				"Apa yang dimaksud dengan istilah fakultas?",
				"Apa peran dan fungsi fakultas di sebuah universitas?",
				"Apa ciri-ciri sebuah fakultas?",
				"Dapatkah Anda menjelaskan apa itu fakultas?",
				"Apa arti dari fakultas dalam sistem pendidikan tinggi?",
				"Apa yang membedakan fakultas dari departemen atau program studi?",
				"Apa struktur organisasi fakultas di perguruan tinggi?"
			],
			"responses": "Fakultas adalah semua fakultas di lingkungan Universitas Mataram."
		},
		{
			"tag": "Jurusan_Definition",
			"patterns": [
				"Apa yang dimaksud dengan jurusan?",
				"Definisi jurusan",
				"Apa pengertian dari jurusan?",
				"Bagaimana mendefinisikan jurusan dalam konteks pendidikan?",
				"Apa yang dimaksud dengan istilah jurusan?",
				"Apa perbedaan antara jurusan dan fakultas?",
				"Apa peran dan fungsi jurusan di sebuah universitas?",
				"Apa yang membedakan jurusan dari program studi?",
				"Dapatkah Anda menjelaskan apa itu jurusan?",
				"Apa arti dari jurusan dalam sistem pendidikan tinggi?",
				"Apa yang termasuk dalam kategori jurusan di perguruan tinggi?"
			],
			"responses": "Jurusan adalah semua unsur pelaksana akademik yang melaksanakan pendidikan akademik dan/atau profesional dalam satu atau seperangkat ilmu pengetahuan, teknologi dan/atau kesenian tertentu di lingkungan Universitas Mataram."
		},
		{
			"tag": "Program Studi_Definition",
			"patterns": [
				"Apa yang dimaksud dengan Program Studi?",
				"Definisi program studi",
				"Apa pengertian dari program studi?",
				"Bagaimana mendefinisikan program studi dalam konteks pendidikan?",
				"Apa yang dimaksud dengan istilah program studi?",
				"Apa peran dan fungsi program studi di sebuah universitas?",
				"Apa perbedaan antara program studi dan jurusan?",
				"Apa yang termasuk dalam kategori program studi di perguruan tinggi?",
				"Dapatkah Anda menjelaskan apa itu program studi?",
				"Apa arti dari program studi dalam sistem pendidikan tinggi?",
				"Apa yang membedakan program studi dari kursus atau mata kuliah?"
			],
			"responses": "Program Studi adalah kesatuan kegiatan pendidikan dan Pembelajaran yang memiliki Kurikulum dan metode Pembelajaran tertentu dalam satu jenis pendidikan akademik, pendidikan profesi, dan/atau pendidikan vokasi."
		},
		{
			"tag": "Pendidikan_Profesional_Definition",
			"patterns": [
				"Apa yang dimaksud dengan pendidikan profesional?",
				"Definisi pendidikan profesional?",
				"Apa pengertian dari pendidikan profesional?",
				"Bagaimana mendefinisikan pendidikan profesional?",
				"Apa yang dimaksud dengan istilah pendidikan profesional?",
				"Apa tujuan dari pendidikan profesional?",
				"Apa perbedaan antara pendidikan profesional dan pendidikan formal?",
				"Apa yang termasuk dalam kategori pendidikan profesional?",
				"Dapatkah Anda menjelaskan konsep pendidikan profesional?",
				"Apa arti dari pendidikan profesional dalam konteks karier?",
				"Apa manfaat dari mengikuti pendidikan profesional?"
			],
			"responses": "Pendidikan profesional adalah pendidikan yang diarahkan terutama pada kesiapan penerapan keahlian tertentu dan diselenggarakan oleh akademik, politeknik, sekolah tinggi, institut, dan universitas."
		},
		{
			"tag": "Pendidikan_Profesional_Definition",
			"patterns": [
				"Apa yang dimaksud dengan pendidikan profesional?",
				"Definisi pendidikan profesional?",
				"Apa yang dimaksud dengan pendidikan profesional?",
				"Bagaimana mendefinisikan pendidikan profesional?",
				"Apa pengertian pendidikan profesional dalam konteks pekerjaan?",
				"Apa tujuan utama dari pendidikan profesional?",
				"Apa perbedaan antara pendidikan profesional dan pendidikan akademik?",
				"Apa ciri-ciri pendidikan profesional?",
				"Apa manfaat dari pendidikan profesional bagi karier seseorang?",
				"Apa saja bentuk dari pendidikan profesional?",
				"Apa yang membedakan pendidikan profesional dari pelatihan biasa?"
			],
			"responses": "Pendidikan profesional adalah pendidikan yang diarahkan terutama pada kesiapan penerapan keahlian tertentu dan diselenggarakan oleh akademik, politeknik, sekolah tinggi, institut, dan universitas."
		},
		{
			"tag": "Dosen_Definition",
			"patterns": [
				"Siapakah dosen itu?",
				"Definisi dosen?",
				"Apa pengertian dari dosen?",
				"Bagaimana mendefinisikan dosen dalam konteks pendidikan?",
				"Apa yang dimaksud dengan istilah dosen?",
				"Apa peran dan tanggung jawab seorang dosen?",
				"Apa ciri-ciri dosen di perguruan tinggi?",
				"Apa yang membedakan dosen dari pengajar atau guru?",
				"Dapatkah Anda menjelaskan apa itu dosen?",
				"Apa arti dari dosen dalam sistem pendidikan tinggi?",
				"Apa kualifikasi yang diperlukan untuk menjadi dosen?"
			],
			"responses": "Dosen adalah pendidik profesional dan ilmuwan dengan tugas utama mentransformasikan, mengembangkan, dan menyebarluaskan ilmu pengetahuan, teknologi melalui pendidikan, penelitian, dan Pengabdian kepada Masyarakat."
		},
		{
			"tag": "Tenaga_Kependidikan_Definition",
			"patterns": [
				"Apa yang dimaksud dengan tenaga kependidikan?",
				"Definisi tenaga kependidikan?",
				"Apa pengertian dari tenaga kependidikan?",
				"Bagaimana mendefinisikan tenaga kependidikan?",
				"Apa yang dimaksud dengan istilah tenaga kependidikan?",
				"Apa peran dan tanggung jawab tenaga kependidikan di sebuah institusi pendidikan?",
				"Apa ciri-ciri tenaga kependidikan?",
				"Apa perbedaan antara tenaga kependidikan dan tenaga pengajar?",
				"Dapatkah Anda menjelaskan apa itu tenaga kependidikan?",
				"Apa arti dari tenaga kependidikan dalam sistem pendidikan?",
				"Apa kualifikasi yang diperlukan untuk menjadi tenaga kependidikan?"
			],
			"responses": "Tenaga Kependidikan adalah anggota masyarakat yang mengabdikan diri dan diangkat untuk menunjang penyelenggaraan Pendidikan Tinggi."
		},
		{
			"tag": "Penasehat_Akademik_Definition",
			"patterns": [
				"Apa yang dimaksud dengan penasehat akademik?",
				"Definisi penasehat akademik",
				"Apa pengertian dari penasehat akademik?",
				"Bagaimana mendefinisikan penasehat akademik?",
				"Apa yang dimaksud dengan istilah penasehat akademik?",
				"Apa peran dan tanggung jawab penasehat akademik di perguruan tinggi?",
				"Apa ciri-ciri penasehat akademik?",
				"Apa perbedaan antara penasehat akademik dan dosen?",
				"Dapatkah Anda menjelaskan apa itu penasehat akademik?",
				"Apa arti dari penasehat akademik dalam konteks pendidikan tinggi?",
				"Apa kualifikasi yang diperlukan untuk menjadi penasehat akademik?"
			],
			"responses": "Penasehat Akademik (PA) adalah dosen yang membimbing mahasiswa agar dapat menyelesaikan studinya dengan baik."
		},
		{
			"tag": "Sistem_Kredit_Semester_Definition",
			"patterns": [
				"Apa yang dimaksud dengan sistem kredit semester?",
				"Definisi sistem kredit semester?",
				"Apa pengertian dari sistem kredit semester?",
				"Bagaimana mendefinisikan sistem kredit semester?",
				"Apa yang dimaksud dengan istilah sistem kredit semester?",
				"Apa prinsip dasar dari sistem kredit semester?",
				"Apa peran sistem kredit semester dalam pendidikan tinggi?",
				"Apa yang membedakan sistem kredit semester dari sistem penilaian lainnya?",
				"Dapatkah Anda menjelaskan konsep sistem kredit semester?",
				"Apa arti dari sistem kredit semester dalam konteks akademik?",
				"Apa manfaat dari menggunakan sistem kredit semester?"
			],
			"responses": "Sistem Kredit Semester adalah suatu sistem penyelenggaraan pendidikan dengan menggunakan satuan kredit semester (sks) untuk menyatakan beban studi mahasiswa, beban kerja dosen, dan beban penyelenggara"
		},
		{
			"tag": "tujuan_sistem_kredit_semester_dan_sistem_blok",
			"patterns": [
				"tujuan penerapan sistem kredit semester dan sistem blok",
				"Apa tujuan dari penerapan sistem kredit semester dan sistem blok?",
				"Mengapa Universitas Mataram menggunakan sistem kredit semester dan sistem blok?",
				"Apa manfaat dari sistem kredit semester dan sistem blok bagi mahasiswa?",
				"Bagaimana sistem kredit semester dan sistem blok mendukung proses pendidikan?",
				"Apa yang ingin dicapai dengan penerapan sistem kredit semester di Universitas Mataram?"
			],
			"responses": "Tujuan umum penerapan Sistem Kredit Semester dan Sistem Blok adalah agar Universitas dapat memenuhi tuntutan pembangunan, memungkinkan penyajian program yang bervariasi dan fleksibel sehingga memberi kemungkinan yang lebih luas kepada mahasiswa untuk memilih program yang sesuai dengan minat dan kemampuannya."
		},
		{
			"tag": "penjelasan_sistem_kredit_semester",
			"patterns": [
				"penjelasan sistem kredit semester",
				"Apa penjelasan mengenai sistem kredit semester?",
				"Bagaimana cara kerja sistem kredit semester?",
				"Apa yang dimaksud dengan sistem kredit semester?",
				"Apa prinsip dasar dari sistem kredit semester?",
				"Bagaimana sistem kredit semester diterapkan di perguruan tinggi?",
				"Apa saja komponen utama dalam sistem kredit semester?",
				"Apa manfaat dari sistem kredit semester bagi mahasiswa?",
				"Bagaimana sistem kredit semester mempengaruhi perencanaan studi?",
				"Apa yang perlu diketahui tentang sistem kredit semester?"
			],
			"responses": "Sistem kredit semester menggunakan sks (Satuan Kredit Semester). Setiap semester memuat sejumlah mata kuliah atau blok atau kegiatan, yang masing-masing diberi bobot yang diukur dengan satuan kredit semester (sks)."
		},
		{
			"tag": "penjelasan_sistem_blok",
			"patterns": [
				"penjelasan sistem blok",
				"Apa penjelasan mengenai sistem blok?",
				"Bagaimana cara kerja sistem blok dalam pendidikan?",
				"Apa yang dimaksud dengan sistem blok?",
				"Apa prinsip dasar dari sistem blok?",
				"Bagaimana sistem blok diterapkan di perguruan tinggi?",
				"Apa manfaat dari sistem blok bagi mahasiswa dan pengajaran?",
				"Apa perbedaan antara sistem blok dan sistem semester?",
				"Bagaimana sistem blok mempengaruhi perencanaan studi dan kurikulum?",
				"Apa yang perlu diketahui tentang sistem blok?"
			],
			"responses": "Sistem blok berlaku hanya untuk Program Studi Pendidikan Dokter. Tujuan khususnya adalah mengintegrasikan semua disiplin ilmu kedokteran yang terkait dalam satu blok tertentu, dengan implementasi melalui beberapa model/kegiatan pembelajaran dengan menitikberatkan pada pembelajaran mandiri oleh mahasiswa (student-centered learning) dan meningkatkan motivasi mahasiswa untuk belajar secara terus-menerus (lifelong learning)"
		},
		{
			"tag": "Pancasila",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Pancasila?",
				"Apa isi dari mata kuliah Pancasila?",
				"Apa materi utama dalam mata kuliah Pancasila?",
				"Apa tujuan dari mata kuliah Pancasila?",
				"Apa saja topik yang dibahas dalam mata kuliah Pancasila?",
				"Apa peran mata kuliah Pancasila dalam pendidikan tinggi?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Pancasila?",
				"Bagaimana mata kuliah Pancasila diterapkan dalam kurikulum?",
				"Apa yang termasuk dalam pembelajaran mata kuliah Pancasila?"
			],
			"responses": [
				"Mata kuliah Pancasila mengajarkan tentang Pancasila dan penjabaranannya agar mahasiswa dapat memahami, menghayati dan mengamalkan nilai-nilai Pancasila. Menghargai dan mengamalkan sistem kenegaraan Republik Indonesia berdasarkan UUD 1945 amandemen serta memahami usaha mewujudkan cita-cita bangsa Indonesia."
			]
		},
		{
			"tag": "Kecakapan Antarpersonal",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Kecakapan Antarpersonal?",
				"Apa isi dari mata kuliah Kecakapan Antarpersonal?",
				"Apa yang diajarkan dalam mata kuliah Kecakapan Antarpersonal?",
				"Apa isi dari mata kuliah Kecakapan Antarpersonal?",
				"Apa tujuan dari mata kuliah Kecakapan Antarpersonal?",
				"Apa saja topik yang dibahas dalam mata kuliah Kecakapan Antarpersonal?",
				"Apa peran mata kuliah Kecakapan Antarpersonal dalam pengembangan diri?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Kecakapan Antarpersonal?",
				"Bagaimana mata kuliah Kecakapan Antarpersonal diterapkan dalam kehidupan sehari-hari?",
				"Apa yang termasuk dalam pembelajaran mata kuliah Kecakapan Antarpersonal?"
			],
			"responses": [
				"Mata kuliah Kecakapan Antarpersonal mengajarkan tentang metode praktikal untuk berinteraksi secara strategis dengan orang lain sesuai dengan beragam prinsip dan etika yang berlaku di dalam dinamika interaksi antar personal sehingga interaksi yang terbangun dapat memperoleh hasil yang konstruktif bagi banyak pihak."
			]
		},
		{
			"tag": "Pengantar Teknologi Informasi",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Pengantar Teknologi Informasi?",
				"Apa isi dari mata kuliah Pengantar Teknologi Informasi?",
				"Apa materi utama dalam mata kuliah Pengantar Teknologi Informasi?",
				"Apa tujuan dari mata kuliah Pengantar Teknologi Informasi?",
				"Apa saja topik yang dibahas dalam mata kuliah Pengantar Teknologi Informasi?",
				"Apa peran mata kuliah Pengantar Teknologi Informasi dalam pemahaman teknologi?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Pengantar Teknologi Informasi?",
				"Bagaimana mata kuliah Pengantar Teknologi Informasi diterapkan dalam perkembangan teknologi?",
				"Apa yang termasuk dalam pembelajaran mata kuliah Pengantar Teknologi Informasi?"
			],
			"responses": [
				"Mata kuliah Pengantar Teknologi Informasi bertujuan agar mahasiswa memahami konsep dasar teknologi informasi, pengenalan dasar perkembangan computer, system computer, teknologi perangkat keras computer, teknologi perangkat lunak, teknologi komunikasi, manajemen internet dan web, e-commerce dan e-business, dan system pendukung keputusan sehingga mahasiswa dapat memahami dan memanfaatkan dalam penggunaan teknologi informasi."
			]
		},
		{
			"tag": "Kewirausahaan",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Kewirausahaan?",
				"Apa isi dari mata kuliah Kewirausahaan?",
				"Apa materi utama dalam mata kuliah Kewirausahaan?",
				"Apa tujuan dari mata kuliah Kewirausahaan?",
				"Apa saja topik yang dibahas dalam mata kuliah Kewirausahaan?",
				"Bagaimana mata kuliah Kewirausahaan membantu dalam membangun bisnis?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Kewirausahaan?",
				"Bagaimana mata kuliah Kewirausahaan diterapkan dalam kehidupan nyata?",
				"Apa peran mata kuliah Kewirausahaan dalam mengembangkan keterampilan bisnis?"
			],
			"responses": [
				"Mata kuliah Kewirausahaan mengajarkan tentang beragam teknik-teknik untuk melakukan wirausaha dengan menerapkan teknologi informasi secara tepat guna. Setelah mengikuti kuliah ini, mahasiswa diharapkan mampu menerapkan beragam pola pikir dan strategi wirausaha berbasis teknologi informasi sehingga menghasilkan bidang usaha berbasis teknologi informasi yang bermanfaat bagi masyarakat umum."
			]
		},
		{
			"tag": "Logika Informatika",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Logika Informatika?",
				"Apa isi dari mata kuliah Logika Informatika?",
				"Apa materi utama dalam mata kuliah Logika Informatika?",
				"Apa tujuan dari mata kuliah Logika Informatika?",
				"Apa saja topik yang dibahas dalam mata kuliah Logika Informatika?",
				"Bagaimana Logika Informatika diterapkan dalam pemrograman?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Logika Informatika?",
				"Apa hubungan antara Logika Informatika dan Algoritma?",
				"Bagaimana Logika Informatika membantu dalam pengembangan perangkat lunak?"
			],
			"responses": [
				"Mata kuliah Logika Informatika mengajarkan bagaimana mahasiswa menganalisis suatu argumen sesuai dengan metode-metode validitas argumen logika proposisional dan logika predikat."
			]
		},
		{
			"tag": "Kalkulus I",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Kalkulus I?",
				"Apa isi dari mata kuliah Kalkulus I?",
				"Apa materi utama dalam mata kuliah Kalkulus I?",
				"Apa saja topik yang dibahas dalam mata kuliah Kalkulus I?",
				"Apa tujuan dari mata kuliah Kalkulus I?",
				"Bagaimana Kalkulus I diterapkan dalam ilmu pengetahuan dan teknik?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Kalkulus I?",
				"Bagaimana diferensial dan integral dipelajari dalam Kalkulus I?",
				"Apa hubungan antara Kalkulus I dan analisis fungsi?"
			],
			"responses": [
				"Mata kuliah Kalkulus I merupakan mata kuliah matematika yang paling dasar. Tujuan mata kuliah ini untuk membangun kemampuan memahami serta logika berfikir mahasiswa untuk menentukan Bilangan Real, Pertidaksamaan dan Nilai Mutlak, Sistem Koordinat, Grafik Persamaan, Fungsi dan Grafiknya, Operasi pada Fungsi, Fungsi trigonometri, Limit, Turunan, Penggunaan Turunan, Integral, Penggunaan Integral, Fungsi Transenden."
			]
		},
		{
			"tag": "Sistem Digital",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Sistem Digital?",
				"Apa isi dari mata kuliah Sistem Digital?",
				"Apa materi utama dalam mata kuliah Sistem Digital?",
				"Apa saja topik yang dibahas dalam mata kuliah Sistem Digital?",
				"Apa tujuan dari mata kuliah Sistem Digital?",
				"Bagaimana Sistem Digital diterapkan dalam perangkat elektronik?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Sistem Digital?",
				"Bagaimana gerbang logika digunakan dalam Sistem Digital?",
				"Apa hubungan antara Sistem Digital dan sirkuit elektronik?"
			],
			"responses": [
				"Mata kuliah Sistem Digital bertujuan untuk membangkitkan kemampuan berpikir logis mahasiswa melalui hukum-hukum dan sarana rangkaian logika, serta penggunaannya dalam bidang teknik informatika. Materi yang dibahas pada mata kuliah ini meliputi: Sistem bilangan, Aljabar Boolean, Gerbang Logika, Penyederhanaan Fungsi, Logika Kombinasi, Flip-flop, dan Logika Sekuensial."
			]
		},
		{
			"tag": "Pendidikan Agama",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Pendidikan Agama?",
				"Apa isi dari mata kuliah Pendidikan Agama?",
				"Apa materi utama dalam mata kuliah Pendidikan Agama?",
				"Apa saja topik yang dibahas dalam mata kuliah Pendidikan Agama?",
				"Apa tujuan dari mata kuliah Pendidikan Agama?",
				"Bagaimana mata kuliah Pendidikan Agama membantu dalam pengembangan spiritual?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Pendidikan Agama?"
			],
			"responses": [
				"Pendidikan Agama di Perguruan Tinggi bertujuan untuk membantu terbinyanya mahasiswa yang beriman dan bertaqwa kepada Tuhan Yang Maha Esa, berbudi pekerti luhur, berfikir filosofis, bersikap rasional, berpandangan luas, ikut serta mengembangkan dan memanfaatkan ilmu dan teknologi untuk kepentingan manusia. Mata kuliah Pendidikan Agama merupakan salah satu komponen yang tidak dapat dipisahkan dari kelompok mata kuliah Pengembangan Kepribadian dalam susunan kurikulum inti Perguruan Tinggi di Indonesia."
			]
		},
		{
			"tag": "Organisasi dan Arsitektur Komputer",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Organisasi dan Arsitektur Komputer?",
				"Apa isi dari mata kuliah Organisasi dan Arsitektur Komputer?",
				"Apa yang diajarkan dalam mata kuliah Organisasi dan Arsitektur Komputer?",
				"Apa isi dari mata kuliah Organisasi dan Arsitektur Komputer?",
				"Apa materi utama dalam mata kuliah Organisasi dan Arsitektur Komputer?",
				"Apa saja topik yang dibahas dalam mata kuliah Organisasi dan Arsitektur Komputer?",
				"Apa tujuan dari mata kuliah Organisasi dan Arsitektur Komputer?",
				"Bagaimana CPU bekerja dalam arsitektur komputer?",
				"Apa peran memori dalam organisasi komputer?",
				"Bagaimana hubungan antara perangkat keras dan perangkat lunak dalam arsitektur komputer?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Organisasi dan Arsitektur Komputer?"
			],
			"responses": [
				"Mata kuliah ini mengajarkan tentang bagaimana prosesor mengeksekusi suatu program, teknik manajemen memori, teknik input output, struktur interkoneksi sistem bus, serta hubungan antara organisasi dan arsitektur komputer."
			]
		},
		{
			"tag": "Komputer dan Masyarakat",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Komputer dan Masyarakat?",
				"Apa isi dari mata kuliah Komputer dan Masyarakat?",
				"Apa materi utama dalam mata kuliah Komputer dan Masyarakat?",
				"Apa saja topik yang dibahas dalam mata kuliah Komputer dan Masyarakat?",
				"Apa tujuan dari mata kuliah Komputer dan Masyarakat?",
				"Bagaimana dampak komputer terhadap masyarakat?",
				"Apa peran teknologi komputer dalam kehidupan sosial?",
				"Bagaimana komputer mempengaruhi aspek etika dan hukum dalam masyarakat?"
			],
			"responses": [
				"Mata kuliah ini bertujuan agar mahasiswa dapat memahami penggunaan dan perkembangan teknologi informasi dalam masyarakat dan dapat mengetahui bidang yang terkait dengan teknologi informasi."
			]
		},
		{
			"tag": "Matematika Diskrit",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Matematika Diskrit?",
				"Apa isi dari mata kuliah Matematika Diskrit?",
				"Apa materi utama dalam mata kuliah Matematika Diskrit?",
				"Apa saja topik yang dibahas dalam mata kuliah Matematika Diskrit?",
				"Apa tujuan dari mata kuliah Matematika Diskrit?",
				"Bagaimana Matematika Diskrit diterapkan dalam ilmu komputer?",
				"Apa peran teori graf dalam Matematika Diskrit?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Matematika Diskrit?"
			],
			"responses": [
				"Mata kuliah ini mengajarkan tentang prinsip dasar beragam objek diskrit dan bagaimana cara mengolahnya sebagai dasar dari beragam ilmu teknik informatika."
			]
		},
		{
			"tag": "Aljabar Linier",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Aljabar Linier?",
				"Apa isi dari mata kuliah Aljabar Linier?",
				"Apa materi utama dalam mata kuliah Aljabar Linier?",
				"Apa saja topik yang dibahas dalam mata kuliah Aljabar Linier?",
				"Apa tujuan dari mata kuliah Aljabar Linier?",
				"Bagaimana Aljabar Linier digunakan dalam ilmu komputer?",
				"Apa peran matriks dalam Aljabar Linier?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Aljabar Linier?"
			],
			"responses": [
				"Mata kuliah Aljabar Linier memberikan pengetahuan kepada mahasiswa untuk menguasai teknik dasar dalam aljabar linier elementer serta menerapkannya dalam menyelesaikan masalah sistem linier."
			]
		},
		{
			"tag": "Algoritma dan Pemrograman",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Algoritma dan Pemrograman?",
				"Apa isi dari mata kuliah Algoritma dan Pemrograman?",
				"Apa materi utama dalam mata kuliah Algoritma dan Pemrograman?",
				"Apa saja topik yang dibahas dalam mata kuliah Algoritma dan Pemrograman?",
				"Apa tujuan dari mata kuliah Algoritma dan Pemrograman?",
				"Bagaimana algoritma digunakan dalam pemrograman?",
				"Apa peran struktur data dalam pemrograman?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Algoritma dan Pemrograman?"
			],
			"responses": [
				"Mata kuliah ini bertujuan agar mahasiswa dapat mengimplementasikan algoritma dan pemrograman dalam kehidupan sehari-hari sehingga diperoleh mahasiswa yang cakap akan algoritma dan mudah dalam mengimplementasikannya bahkan pemrograman khususnya C++."
			]
		},
		{
			"tag": "Probabilitas dan Statistika",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Probabilitas dan Statistika?",
				"Apa isi dari mata kuliah Probabilitas dan Statistika?",
				"Apa materi utama dalam mata kuliah Probabilitas dan Statistika?",
				"Apa saja topik yang dibahas dalam mata kuliah Probabilitas dan Statistika?",
				"Apa tujuan dari mata kuliah Probabilitas dan Statistika?",
				"Bagaimana probabilitas diterapkan dalam statistika?",
				"Apa peran distribusi probabilitas dalam analisis data?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Probabilitas dan Statistika?"
			],
			"responses": [
				"Matakuliah ini membahas konsep statistik dan representasi data yang terdiri dari variabel random, distribusi data, dan sampling. Pengetahuan yang diperoleh dapat digunakan untuk menyelesaikan permasalahan yang berhubungan dengan pengolahan data, pengolahan sinyal digital, pemrosesan bahasa alami, dan lain-lain."
			]
		},
		{
			"tag": "Algoritma dan Struktur Data",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Algoritma dan Struktur Data?",
				"Apa isi dari mata kuliah Algoritma dan Struktur Data?",
				"Apa materi utama dalam mata kuliah Algoritma dan Struktur Data?",
				"Apa saja topik yang dibahas dalam mata kuliah Algoritma dan Struktur Data?",
				"Apa tujuan dari mata kuliah Algoritma dan Struktur Data?",
				"Bagaimana algoritma dan struktur data digunakan dalam pemrograman?",
				"Apa peran struktur data dalam desain algoritma?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Algoritma dan Struktur Data?"
			],
			"responses": [
				"Mata kuliah ini mengajarkan berbagai macam struktur data umum yang dapat diimplementasikan dalam program komputer. Bahasan struktur data mencakup Abstract Data Type (ADT), list (linked list) dan variansinya, tumpukan (stack), antrian (queue), pohon (tree) dan graf."
			]
		},
		{
			"tag": "Sistem Informasi",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Sistem Informasi?",
				"Apa isi dari mata kuliah Sistem Informasi?",
				"Apa materi utama dalam mata kuliah Sistem Informasi?",
				"Apa saja topik yang dibahas dalam mata kuliah Sistem Informasi?",
				"Apa tujuan dari mata kuliah Sistem Informasi?",
				"Bagaimana sistem informasi diterapkan dalam organisasi?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Sistem Informasi?"
			],
			"responses": [
				"Mata kuliah ini bertujuan agar mahasiswa dapat mendesain Sistem Informasi dengan menganalisis masalah dan kebutuhan SI, memproyeksikan desain, serta melakukan testing terhadap Sistem Informasi."
			]
		},
		{
			"tag": "Sistem Operasi",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Sistem Operasi?",
				"Apa isi dari mata kuliah Sistem Operasi?",
				"Apa materi utama dalam mata kuliah Sistem Operasi?",
				"Apa saja topik yang dibahas dalam mata kuliah Sistem Operasi?",
				"Apa tujuan dari mata kuliah Sistem Operasi?",
				"Bagaimana sistem operasi mengelola perangkat keras dan perangkat lunak?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Sistem Operasi?"
			],
			"responses": [
				"Mata kuliah ini mengajarkan tentang fungsi sistem operasi pada sistem komputer, manajemen proses, teknik-teknik penjadwalan proses, thread, dan penggunaan memori serta teknik pengalokasian memori."
			]
		},
		{
			"tag": "Metode Numerik",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Metode Numerik?",
				"Apa isi dari mata kuliah Metode Numerik?",
				"Apa materi utama dalam mata kuliah Metode Numerik?",
				"Apa saja topik yang dibahas dalam mata kuliah Metode Numerik?",
				"Apa tujuan dari mata kuliah Metode Numerik?",
				"Bagaimana mengelola Metode Numerik?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Metode Numerik?"
			],
			"responses": [
				"Mata kuliah ini bertujuan untuk memberikan pemahaman tentang metode-metode numerik untuk menyelesaikan masalah-masalah teknik dengan bantuan komputer."
			]
		},
		{
			"tag": "Interaksi Manusia dan Komputer",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Interaksi Manusia dan Komputer?",
				"Apa isi dari mata kuliah Interaksi Manusia dan Komputer?",
				"Apa materi utama dalam mata kuliah Interaksi Manusia dan Komputer?",
				"Apa saja topik yang dibahas dalam mata kuliah Interaksi Manusia dan Komputer?",
				"Apa tujuan dari mata kuliah Interaksi Manusia dan Komputer?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Interaksi Manusia dan Komputer?"
			],
			"responses": [
				"Mata kuliah ini bertujuan agar mahasiswa dapat mempunyai pemahaman mengenai konsep interaksi manusia dan komputer secara keseluruhan yang berhubungan dengan mendesain, mengevaluasi, dan mengaplikasikan user interface."
			]
		},
		{
			"tag": "Sistem Basis Data",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Sistem Basis Data?",
				"Apa isi dari mata kuliah Sistem Basis Data?",
				"Apa materi utama dalam mata kuliah Sistem Basis Data?",
				"Apa saja topik yang dibahas dalam mata kuliah Sistem Basis Data?",
				"Apa tujuan dari mata kuliah Sistem Basis Data?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Sistem Basis Data?"
			],
			"responses": [
				"Mata kuliah ini memberikan pengetahuan mengenai Konsep Dasar Basis Data, Sistem & Arsitektur Basis Data, Pemodelan Data menggunakan ER Diagram, Model Relasional, Normalisasi Database, dan SQL Query."
			]
		},
		{
			"tag": "Jaringan Komputer",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Jaringan Komputer?",
				"Apa isi dari mata kuliah Jaringan Komputer?",
				"Apa materi utama dalam mata kuliah Jaringan Komputer?",
				"Apa saja topik yang dibahas dalam mata kuliah Jaringan Komputer?",
				"Apa tujuan dari mata kuliah Jaringan Komputer?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Jaringan Komputer?"
			],
			"responses": [
				"Mata kuliah ini mengajarkan tentang cara mendesain topologi jaringan sederhana, melakukan konfigurasi peralatan jaringan, hingga melakukan simulasi jaringan sesuai dengan teori Jaringan Komputer."
			]
		},
		{
			"tag": "Sistem Berkas",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Sistem Berkas?",
				"Apa isi dari mata kuliah Sistem Berkas?",
				"Apa materi utama dalam mata kuliah Sistem berkas?",
				"Apa saja topik yang dibahas dalam mata kuliah Sistem Berkas?",
				"Apa tujuan dari mata kuliah Sistem Berkas?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Sistem Berkas?"
			],
			"responses": [
				"Matakuliah ini membahas Konsep dasar berkas, Blocking dan buffering, Penyimpanan data, Organisasi berkas primer, Berkas langsung, Manajemen kolisi, Organisasi berkas sekunsial berindeks, File Berindeks, dan Pengurutan rekaman."
			]
		},
		{
			"tag": "Analisis dan Perancangan Berorientasi Objek",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Analisis dan Perancangan Berorientasi Objek?",
				"Apa isi dari mata kuliah Analisis dan Perancangan Berorientasi Objek?",
				"Apa materi utama dalam mata kuliah Analisis dan Perancangan Berorientasi Objek?",
				"Apa saja topik yang dibahas dalam mata kuliah Analisis dan Perancangan Berorientasi Objek?",
				"Apa tujuan dari mata kuliah Analisis dan Perancangan Berorientasi Objek?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Analisis dan Perancangan Berorientasi Objek?"
			],
			"responses": [
				"Mata kuliah ini membahas metode pengembangan Software Development Life Cycle (SDLC), konsep berorientasi objek, model kebutuhan: use case model, analisis arsitektur perangkat lunak, analisis use case, dan pengetahuan tentang metodologi objekt lainnya."
			]
		},
		{
			"tag": "Rekayasa Perangkat Lunak",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Rekayasa Perangkat Lunak?",
				"Apa isi dari mata kuliah Rekayasa Perangkat Lunak?",
				"Apa yang diajarkan dalam mata kuliah Rekayasa Perangkat Lunak?",
				"Apa isi dari mata kuliah Rekayasa Perangkat Lunak?",
				"Apa materi utama dalam mata kuliah Rekayasa Perangkat Lunak?",
				"Apa saja topik yang dibahas dalam mata kuliah Rekayasa Perangkat Lunak?",
				"Apa tujuan dari mata kuliah Rekayasa Perangkat Lunak?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Rekayasa Perangkat Lunak?"
			],
			"responses": [
				"Mata kuliah ini bertujuan agar mahasiswa dapat membuat dokumen perangkat lunak dengan melakukan perencanaan, analisis, dan rancangan perangkat lunak dengan menggunakan metode/ paradigma pengembangan perangkat lunak sesuai dengan tujuan dari rekayasa perangkat lunak yang akan dibangun."
			]
		},
		{
			"tag": "Pengolahan Citra Digital",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Pengolahan Citra Digital?",
				"Apa isi dari mata kuliah Pengolahan Citra Digital?",
				"Apa yang diajarkan dalam mata kuliah Citra Digital?",
				"Apa isi dari mata kuliah Citra Digital?",
				"Apa materi utama dalam mata kuliah Citra Digital?",
				"Apa saja topik yang dibahas dalam mata kuliah Citra Digital?",
				"Apa tujuan dari mata kuliah Citra Digital?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Citra Digital?"
			],
			"responses": [
				"Mata Kuliah ini mengajarkan mahasiswa untuk melakukan pengolahan citra dua dimensi secara digital menggunakan komputer dengan teknik-teknik yang sesuai. Konsep yang dibahas meliputi, akuisisi citra, ruang warna, histogram, konvolusi, perkalian citra, morfologi dan pengenalan ekstraksi citra."
			]
		},
		{
			"tag": "Tata Tulis Karya Ilmiah",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Tata Tulis Karya Ilmiah?",
				"Apa isi dari mata kuliah Tata Tulis Karya Ilmiah?",
				"Apa yang diajarkan dalam mata kuliah Tata Tulis Karya Ilmiah?",
				"Apa isi dari mata kuliah Tata Tulis Karya Ilmiah?",
				"Apa materi utama dalam mata kuliah Tata Tulis Karya Ilmiah?",
				"Apa saja topik yang dibahas dalam mata kuliah Tata Tulis Karya Ilmiah?",
				"Apa tujuan dari mata kuliah Tata Tulis Karya Ilmiah?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Tata Tulis Karya Ilmiah?"
			],
			"responses": [
				"Mata kuliah yang mengajarkan materi ejaan, tata kalimat, tata kalimat, istilah, silogisme, definisi, paragraf, perancangan karya tulis ilmiah, penyusunan kerangka, komponen karya tulis ilmiah, serta konvensi naskah."
			]
		},
		{
			"tag": "Pemrograman Web",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Pemrograman Web?",
				"Apa isi dari mata kuliah Pemrograman Web?",
				"Apa yang diajarkan dalam mata kuliah Pemrograman Web?",
				"Apa isi dari mata kuliah Pemrograman Web?",
				"Apa materi utama dalam mata kuliah Pemrograman Web?",
				"Apa saja topik yang dibahas dalam mata kuliah Pemrograman Web?",
				"Apa tujuan dari mata kuliah Pemrograman Web?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Pemrograman Web?"
			],
			"responses": [
				"Mata Kuliah ini mengajarkan pengetahuan mengenai konsep dasar internet dan pemrograman web, serta pemanfaatannya untuk mendistribusikan informasi. Diajarakan juga kemampuan pemrograman web untuk menyediakan dokumen dengan estetika yang baik."
			]
		},
		{
			"tag": "Pemrosesan Paralel",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Pemrosesan Paralel?",
				"Apa isi dari mata kuliah Pemrosesan Paralel?",
				"Apa yang diajarkan dalam mata kuliah Pemrosesan Paralel?",
				"Apa isi dari mata kuliah Pemrosesan Paralel?",
				"Apa materi utama dalam mata kuliah Pemrosesan Paralel?",
				"Apa saja topik yang dibahas dalam mata kuliah Pemrosesan Paralel?",
				"Apa tujuan dari mata kuliah Pemrosesan Paralel?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Pemrosesan Paralel?"
			],
			"responses": [
				"Mata kuliah yang membahas konsep arsitektur parallel computing dan pemrograman berbasis message passing interface (MPI) dan penerapannya dalam berbagai bidang komputasi modern."
			]
		},
		{
			"tag": "Etika Profesi",
			"patterns": [
				"Apa yang diajarkan dalam mata kuliah Etika Profesi?",
				"Apa isi dari mata kuliah Etika Profesi?",
				"Apa yang diajarkan dalam mata kuliah Etika Profesi?",
				"Apa isi dari mata kuliah Etika Profesi?",
				"Apa yang diajarkan dalam mata kuliah Etika Profesi?",
				"Apa isi dari mata kuliah Etika Profesi?",
				"Apa materi utama dalam mata kuliah Etika Profesi?",
				"Apa saja topik yang dibahas dalam mata kuliah Etika Profesi?",
				"Apa tujuan dari mata kuliah Etika Profesi?",
				"Apa yang dipelajari mahasiswa dalam mata kuliah Etika Profesi?"
			],
			"responses": [
				"Mata Kuliah ini bertujuan agar mahasiswa dapat menerapkan konsep etika dan profesionalisme, kode etik teknologi informasi, serta profesionalisme di bidang IT dengan baik."
			]
		},
		{
			"tag": "Kecerdasan Buatan",
			"patterns": [
				"Apa saja topik yang dibahas dalam mata kuliah Kecerdasan Buatan?",
				"Materi apa yang dipelajari di Kecerdasan Buatan?",
				"Apa itu mata kuliah Kecerdasan Buatan?",
				"Apa saja cakupan dari Kecerdasan Buatan?",
				"Apa yang dipelajari di mata kuliah AI?",
				"Isi dari mata kuliah Artificial Intelligence itu apa?",
				"Topik apa yang ada di Kecerdasan Buatan?",
				"Apa yang dibahas dalam AI?",
				"Apa yang diajarkan di kelas Kecerdasan Buatan?"
			]
			,
			"responses": [
				"Kecerdasan Buatan atau kecerdasan yang ditambahkan kepada suatu sistem yang bisa diatur dalam konteks ilmiah atau Artificial Intelligence didefinisikan sebagai kecerdasan entitas ilmiah."
			]
		},
		{
			"tag": "Pemrograman Berorientasi Objek",
			"patterns": [
				"Apa saja yang dipelajari dalam mata kuliah Pemrograman Berorientasi Objek?",
				"Materi apa yang ada di Pemrograman Berorientasi Objek?",
				"Apa itu mata kuliah Pemrograman Berorientasi Objek?",
				"Topik apa saja yang dibahas dalam Pemrograman Berorientasi Objek?",
				"Apa yang dimaksud dengan Pemrograman Berorientasi Objek?",
				"Apa saja konsep utama dalam Pemrograman Berorientasi Objek?",
				"Isi dari mata kuliah OOP itu apa?",
				"Apa yang diajarkan di kelas Pemrograman Berorientasi Objek?",
				"Materi utama dari Pemrograman Berorientasi Objek apa saja?"
			]
			,
			"responses": [
				"Matakuliah ini membahas bahasa pemrograman berorientasi objek sesuai dengan konsep abstraksi, modular, reusable, dan optimalisasi."
			]
		},
		{
			"tag": "Pemrograman Bergerak",
		"patterns": [
			"Apa saja topik yang dibahas dalam mata kuliah Pemrograman Bergerak?",
			"Materi apa yang dipelajari di Pemrograman Bergerak?",
			"Apa itu mata kuliah Pemrograman Bergerak?",
			"Apa saja cakupan dari Pemrograman Bergerak?",
			"Apa yang dimaksud dengan Pemrograman Bergerak?",
			"Apa yang dipelajari di kelas Pemrograman Bergerak?",
			"Materi utama dari Pemrograman Bergerak apa saja?",
			"Topik apa saja yang ada di Pemrograman Bergerak?",
			"Apa yang diajarkan di Pemrograman Bergerak?"
		],
			"responses": [
				"Mata kuliah ini mempelajari tentang konsep dasar pemrograman bergerak, Sistem Operasi Perangkat Bergerak, dan lingkungan pengembangannya. Dalam perkuliahan akan diajarkan bagaimana membangun perangkat bergerak yang terdiri dari antarmuka, pemrosesan data, sampai dengan pengaksesan perangkat keras dan library eksternal."
			]
		},
		{
			"tag": "Kuliah Kerja Nyata",
		"patterns": [
			"Apa tujuan dari Kuliah Kerja Nyata?",
			"Bagaimana pelaksanaan KKN?",
			"Apa saja kegiatan yang dilakukan selama KKN?",
			"Berapa durasi program KKN?",
			"Apa manfaat mengikuti KKN?",
			"Apa itu Kuliah Kerja Nyata?",
			"KKN dilakukan di mana saja?",
			"Apa saja persiapan untuk KKN?",
			"Siapa saja yang mengikuti program KKN?",
			"Apa yang harus dilakukan mahasiswa saat KKN?"
		],
			"responses": [
				"Kuliah Kerja Nyata (KKN) adalah suatu kegiatan perkuliahan dan kerja lapangan yang merupakan pengintegrasian dari pendidikan dan pengajaran, penelitian, dan pengabdian kepada masyarakat oleh mahasiswa secara pragmatis, berorientasi luas melalui pendekatan interdisipliner, komprehensif, dan lintas sektoral."
			]
		},
		{
			"tag": "Pemrograman Internet",
			"patterns": [
				"Apa saja yang dipelajari dalam mata kuliah Pemrograman Internet?",
				"Materi apa yang ada di Pemrograman Internet?",
				"Apa itu mata kuliah Pemrograman Internet?",
				"Apa saja topik dalam Pemrograman Internet?",
				"Apa yang dimaksud dengan Pemrograman Internet?",
				"Apa fokus utama dari mata kuliah Pemrograman Internet?",
				"Apa saja protokol yang dibahas dalam Pemrograman Internet?",
				"Materi utama dari Pemrograman Internet apa saja?",
				"Bagaimana membuat aplikasi client-server di Pemrograman Internet?",
				"Apa saja konsep dasar Pemrograman Internet yang diajarkan?"
			]
			,
			"responses": [
				"Mata Kuliah ini bertujuan untuk menjelaskan konsep dasar, protokol-protokol yang mengatur internet dan terminologi yang terkait dengannya. Selain itu, memperkenalkan konsep dasar pemrograman jaringan/internet dengan bahasa pemrograman Java dan mahasiswa mampu membuat aplikasi dengan kemampuan komunikasi data dengan basis client-server."
			]
		},
		{
			"tag": "Proyek Perangkat Lunak",
			"patterns": [
				"Apa saja yang dipelajari dalam mata kuliah Proyek Perangkat Lunak?",
				"Materi apa yang ada di Proyek Perangkat Lunak?",
				"Apa itu mata kuliah Proyek Perangkat Lunak?",
				"Apa saja tahapan dalam Proyek Perangkat Lunak?",
				"Apa yang dimaksud dengan manajemen proyek perangkat lunak?",
				"Apa tujuan dari mata kuliah Proyek Perangkat Lunak?",
				"Apa saja metode yang digunakan dalam Proyek Perangkat Lunak?",
				"Bagaimana cara mengelola proyek perangkat lunak?",
				"Apa saja tools yang dipelajari dalam Proyek Perangkat Lunak?",
				"Apa itu WBS dalam konteks Proyek Perangkat Lunak?"
			]
			,
			"responses": [
				"Mata Kuliah ini memberikan pemahaman tentang konsep-konsep yang dipakai, kegiatan, dan proses dalam pembuatan perangkat lunak. Dimulai dari metode-metode yang terlibat dalam pembuatan perangkat lunak, kemudian memilih yang tepat untuk digunakan dalam sebuah studi kasus pembuatan perangkat lunak. Kemudian diajarkan juga untuk manajemen proyek dengan WBS dan tools manajemen project yang tersedia."
			]
		},
		{
			"tag": "Jaringan Syaraf Tiruan",
"patterns": [
    "Apa saja yang dipelajari dalam mata kuliah Jaringan Syaraf Tiruan?",
    "Materi apa yang ada di Jaringan Syaraf Tiruan?",
    "Apa itu mata kuliah Jaringan Syaraf Tiruan?",
    "Apa tujuan dari Jaringan Syaraf Tiruan?",
    "Bagaimana konsep dasar Jaringan Syaraf Tiruan?",
    "Apa yang dimaksud dengan Jaringan Syaraf Tiruan?",
    "Apa saja algoritma yang diajarkan di Jaringan Syaraf Tiruan?",
    "Apa aplikasi Jaringan Syaraf Tiruan di dunia nyata?",
    "Bagaimana cara kerja Jaringan Syaraf Tiruan?",
    "Apa saja model yang dipelajari dalam Jaringan Syaraf Tiruan?"
]
,
			"responses": [
				"Jaringan syaraf tiruan (JST) dalam Bahasa Inggris disebut dengan artificial neural network (ANN), atau juga disebut simulated neural network (SNN), atau umumnya hanya disebut neural network (NN), adalah jaringan dari sekelompok unit pemroses kecil yang dimodelkan berdasarkan sistem saraf manusia. JST merupakan sistem adaptif yang dapat mengubah strukturnya untuk menemukan solusi masalah berdasarkan informasi eksternal maupun internal yang mengalir melalui jaringan tersebut."
			]
		},
		{
			"tag": "Keamanan Teknologi Informasi",
		"patterns": [
			"Apa saja yang dipelajari dalam mata kuliah Keamanan Teknologi Informasi?",
			"Materi apa yang ada di Keamanan Teknologi Informasi?",
			"Apa itu mata kuliah Keamanan Teknologi Informasi?",
			"Apa saja topik yang dibahas dalam Keamanan Teknologi Informasi?",
			"Apa yang dimaksud dengan keamanan sistem informasi?",
			"Apa saja metode hacking yang diajarkan dalam Keamanan Teknologi Informasi?",
			"Apa itu cyber law dalam konteks Keamanan Teknologi Informasi?",
			"Bagaimana cara mengamankan sistem informasi?",
			"Apa yang dipelajari tentang keamanan web di mata kuliah ini?",
			"Bagaimana cara mengamankan sistem wireless?"
		]
,
			"responses": [
				"Materi kuliah mencakup pengertian keamanan, pengertian sistem dan pengertian keamanan sistem, evaluasi keamanan sistem, mengamankan sistem informasi, keamanan email, keamanan web, eksploitasi keamanan sistem, cyber law, keamanan sistem wireless, manajemen keamanan informasi serta metode hacking dan security."
			]
		},
		{
			"tag": "Riset Teknologi Informasi",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Riset Teknologi Informasi?",
			  "Bagaimana cara melakukan riset di Teknologi Informasi?",
			  "Apa yang dimaksud dengan riset di bidang Teknologi Informasi?",
			  "Apa saja metode yang dipelajari dalam Riset Teknologi Informasi?",
			  "Apa saja tahapan dalam melakukan riset teknologi informasi?"
			],
			"responses": [
			  "Materi kuliah ini membahas penulisan dokumen penelitian, meliputi penyusunan kerangka penelitian, penyusunan rumusan masalah, metodologi penelitian, akuisisi data penelitian, analisa data, tata tulis karya ilmiah, dan pemahaman proses publikasi karya ilmiah."
			]
		  },
		  {
			"tag": "Riset Operasional",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Riset Operasional?",
			  "Bagaimana cara menggunakan model optimasi dalam Riset Operasional?",
			  "Apa itu riset operasional dan penerapannya?",
			  "Apa saja metode yang digunakan dalam Riset Operasional?",
			  "Apa perbedaan model deterministik dan probabilistik dalam riset operasional?"
			],
			"responses": [
			  "Matakuliah ini memberikan pengetahuan mengenai model-model optimasi dan perumusannya serta keterampilan dalam memecahkan persoalan-persoalan teknik dan manajemen industri yang dapat dimodelkan secara kuantitatif (matematis), baik bersifat deterministik maupun probabilistik."
			]
		  },
		  {
			"tag": "Teori Bahasa dan Otomata",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Teori Bahasa dan Otomata?",
			  "Apa itu bahasa formal dan grammar?",
			  "Bagaimana hubungan antara automata dan bahasa?",
			  "Apa yang dimaksud dengan komputabilitas dalam Teori Bahasa dan Otomata?",
			  "Apa itu teori automata?"
			],
			"responses": [
			  "Teori bahasa dan otomata merupakan teori dasar bagi ilmu komputer. Terdiri dari teori automata, bahasa formal dan grammar, komputabilitas, dan kompleksitas. Mata kuliah ini mempelajari berbagai automata, dan bagaimana hubungannya dengan bahasa dan grammar."
			]
		  },
		  {
			"tag": "Big Data",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Big Data?",
			  "Bagaimana cara memproses data besar menggunakan Hadoop?",
			  "Apa itu big data dan apa aplikasinya?",
			  "Apa saja tantangan dalam menangani big data?",
			  "Apa yang dimaksud dengan 4V dalam Big Data?"
			],
			"responses": [
			  "Matakuliah yang membahas konsep data besar yang terdiri dari Volume (ukuran), Variety (variasi), Velocity (Kecepatan) dan Veracity (Kekauratan) dari data tersebut. Juga membahas framework big data berbasis Hadoop dan pemrograman algoritma pemrosesan big data berbasis spark."
			]
		  },
		  {
			"tag": "Internet of Things (IoT)",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Internet of Things?",
			  "Apa itu Internet of Things dan aplikasinya?",
			  "Bagaimana cara kerja Internet of Things?",
			  "Apa yang dimaksud dengan wireless sensor network di IoT?",
			  "Bagaimana IoT berperan dalam automation dan sistem kontrol?"
			],
			"responses": [
			  "Matakuliah yang membahas konsep internet of things yaitu segala hal dengan micro-controller yang terhubung ke jaringan internet untuk melakukan berbagai fungsi seperti wireless sensor network, automation, sistem kontrol dan sebagainya."
			]
		  },
		  {
			"tag": "Logika Fuzzy",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Logika Fuzzy?",
			  "Apa itu Fuzzy Inference System?",
			  "Bagaimana Logika Fuzzy diterapkan dalam kecerdasan buatan?",
			  "Apa yang dimaksud dengan Hybrid Fuzzy dalam AI?",
			  "Bagaimana cara menyelesaikan masalah menggunakan Logika Fuzzy?"
			],
			"responses": [
			  "Mata kuliah ini bertujuan agar mahasiswa dapat mengimplementasikan metode-metode dalam Logika Fuzzy untuk menyelesaikan permasalahan-permasalahan yang sederhana maupun kompleks. Dimulai dari Fuzzy Inference System, Fuzzy Database, Fuzzy Quantification Theory, dan Hybrid Fuzzy dengan Artificial Intelligence."
			]
		  },
		  {
			"tag": "Pemodelan dan Simulasi",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Pemodelan dan Simulasi?",
			  "Apa itu simulasi dan bagaimana cara membuat model simulasi?",
			  "Apa itu Markov Chains dalam Pemodelan dan Simulasi?",
			  "Apa saja teknik dalam analisis simulasi?",
			  "Bagaimana cara menganalisis output dari simulasi?"
			],
			"responses": [
			  "Mahasiswa dapat mengerti dan memahami teori tentang algoritma untuk menyusun model-model yang dapat dimanipulasi. Polok Bahasan: Introduction to Modeling and Simulation, Discrete and Continuous Systems, Queuing Systems, Markov Chains, dan Analysis of Simulation Output."
			]
		  },
		  {
			"tag": "Pemrograman Visual",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Pemrograman Visual?",
			  "Apa itu pemrograman visual dan bagaimana implementasinya?",
			  "Bagaimana cara membuat aplikasi visual menggunakan bahasa pemrograman?",
			  "Apa manfaat menggunakan pemrograman visual dalam pembuatan aplikasi?",
			  "Apa saja bahasa pemrograman yang digunakan dalam Pemrograman Visual?"
			],
			"responses": [
			  "Mata kuliah ini memberikan pengetahuan kepada mahasiswa tentang manfaat penggunaan bahasa pemrograman dalam membuat aplikasi secara visual. Mahasiswa diharapkan mampu membuat aplikasi visual dengan mengkombinasikan bahasa pemrograman yang telah dipelajari."
			]
		  },
		  {
			"tag": "Praktek Kerja Lapangan",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Praktek Kerja Lapangan?",
			  "Apa tujuan dari Praktek Kerja Lapangan?",
			  "Apa saja kegiatan yang dilakukan dalam Praktek Kerja Lapangan?",
			  "Bagaimana Praktek Kerja Lapangan mendukung pengembangan pengetahuan mahasiswa?",
			  "Apa itu Laporan PKL dan apa tujuannya?"
			],
			"responses": [
			  "Praktek Kerja Lapangan merupakan matakuliah wajib yang harus diikuti setiap mahasiswa dalam rangka pengembangan pengetahuan mahasiswa dengan luaran Laporan PKL dan Makalah Publikasi pengabdian pada masyarakat."
			]
		  },
		  {
			"tag": "Sistem Terdistribusi",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Sistem Terdistribusi?",
			  "Apa itu komputasi terdistribusi?",
			  "Bagaimana cara merancang sistem terdistribusi yang handal?",
			  "Apa yang dimaksud dengan kehandalan dalam sistem terdistribusi?",
			  "Apa saja metode yang digunakan dalam sistem terdistribusi?"
			],
			"responses": [
			  "Mata Kuliah ini bertujuan untuk memperkenalkan prinsip-prinsip, teknik-teknik dan metode-metode pada komputasi terdistribusi dengan kehandalan dan kekuatan yang cukup sebagai dasar untuk eksplorasi terhadap topik yang lebih spesifik."
			]
		  },
		  {
			"tag": "Sistem Informasi Enterprise",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Sistem Informasi Enterprise?",
			  "Apa itu Sistem Informasi Enterprise dan peranannya di organisasi?",
			  "Apa tantangan yang dihadapi dalam pengelolaan Sistem Informasi Enterprise?",
			  "Bagaimana cara mengelola Sistem Informasi Enterprise?",
			  "Apa manfaat Sistem Informasi Enterprise bagi perusahaan?"
			],
			"responses": [
			  "Mata kuliah ini disusun untuk memberikan pemahaman yang sepenuhnya kepada mahasiswa mengenai konsep Sistem Informasi Enterprise (SIE) beserta peranannya di organisasi dan tantangan-tantangan yang dihadapi dalam pengelolaan SIE."
			]
		  },
		  {
			"tag": "Tata Kelola IT",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Tata Kelola IT?",
			  "Bagaimana cara merancang Tata Kelola IT?",
			  "Apa itu COBIT dan bagaimana cara menggunakannya dalam Tata Kelola IT?",
			  "Apa tujuan dari Tata Kelola IT di perusahaan?",
			  "Bagaimana analisis framework COBIT diterapkan dalam Tata Kelola IT?"
			],
			"responses": [
			  "Mata kuliah ini bertujuan agar mahasiswa dapat merancang Tata Kelola Teknologi Informasi di perusahaan atau instansi dengan melakukan analisis menggunakan framework COBIT versi terbaru."
			]
		  },
		  {
			"tag": "Pengenalan Pola",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Pengenalan Pola?",
			  "Apa itu pengenalan pola dan aplikasinya?",
			  "Bagaimana cara menentukan objek fisik dalam pengenalan pola?",
			  "Apa metode yang digunakan dalam pengenalan pola?",
			  "Apa saja kategori yang digunakan dalam Pengenalan Pola?"
			],
			"responses": [
			  "Matakuliah Pengenalan pola (pattern recognition) merupakan matakuliah pilihan yang mempelajari Teknik penentuan suatu objek fisik/data/kejadian atau kejadian ke dalam salah satu atau beberapa kategori."
			]
		  },
		  {
			"tag": "Analisis dan Perancangan Jaringan",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Analisis dan Perancangan Jaringan?",
			  "Apa itu analisis gap dalam perancangan jaringan?",
			  "Bagaimana cara merancang jaringan yang kompleks?",
			  "Apa yang dimaksud dengan teknik perancangan jaringan?",
			  "Bagaimana cara mengumpulkan kebutuhan untuk perancangan jaringan?"
			],
			"responses": [
			  "Matakuliah ini memberikan pemahaman mengenai bagaimana merancang sistem jaringan dan komunikasi data secara keseluruhan dan memenuhi kebutuhan perusahaan yang ada."
			]
		  },
		  {
			"tag": "Jaringan Komputer Lanjut",
			"patterns": [
			  "Apa yang dipelajari dalam mata kuliah Jaringan Komputer Lanjut?",
			  "Apa itu routing dinamik dalam Jaringan Komputer Lanjut?",
			  "Apa yang dimaksud dengan komunikasi data lanjutan?",
			  "Bagaimana teknologi implementasi pada jaringan komputer diterapkan?",
			  "Apa yang diajarkan tentang routing statik dalam Jaringan Komputer Lanjut?"
			],
			"responses": [
			  "Matakuliah ini memberikan pemahaman konsep lanjutan dari sistem jaringan komputer, yang mencakup teknik routing dan komunikasi data secara canggih serta penerapannya di dunia industri dan organisasi."
			]
		  }
		  
	]
}
